In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Rent.xlsx")

In [3]:
df.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [4]:
df.drop([2],axis=0, inplace=True )

In [5]:
df.drop([4],axis=0, inplace=True )

In [6]:
df.head()

   area   rent
0  2000  31500
1  2100  35000
3  2250  36100
5  1900  32500
6  1500  20000

In [7]:
df.drop("area",axis=1, inplace=True)

In [8]:
df.head(15)

     rent
0   31500
1   35000
3   36100
5   32500
6   20000
7   24500
8   48000
9   31000
10  34500
11  32000
12  34500
13  40050
14  34100
15  51500
16  30500

In [9]:
df.drop(df.index[11:17],inplace=True)

In [11]:
df.head(15)

     rent
0   31500
1   35000
3   36100
5   32500
6   20000
7   24500
8   48000
9   31000
10  34500
11  32000
12  34500
19  47000
20  31500
21  33500
22  70000

# Load the save model

In [9]:
import joblib as jb
reg3 = jb.load("second")

In [8]:
import warnings
warnings.filterwarnings("ignore")

# Gradio Diployment

In [10]:
import gradio as gr

In [11]:
def rent_recom(x):
    rent = reg3.predict([[x]])
    return rent

In [12]:
rent_recom(3000)

array([52134.30695351])

In [13]:
interface = gr.Interface(
    fn = rent_recom,
    inputs = ['number'],
    outputs = ['number']
).launch(share=True)

Running on local URL:  http://127.0.0.1:7863

Could not create share link. Please check your internet connection or our status page: https://status.gradio.app.

Also please ensure that your antivirus or firewall is not blocking the binary file located at: C:\Users\ACER\AppData\Local\Programs\Python\Python311\Lib\site-packages\gradio\frpc_windows_amd64_v0.2